print('Калькулятор')
print('1.Сумма\n2.Разность\n3.Произведение\n4.Деление\n5.Возвести степень')
d=int(input('Введите номер вашего действия:'))
a=int(input('Введите первое число:'))
b=int(input('Введите второе чиcло:'))
if d == 1:
    print('Ответ:',a+b)
elif d == 2:
    print('Ответ:',a-b)
elif d == 3:
    print('Ответ:',a*b)
elif d == 4:
    if b !=0:
        print('Ответ:',a/b)
    else:
        print('На ноль делать нельзя')
elif d == 5:
    print('Ответ:',a**b)
else:
    print('Я не знаю такого действия')